Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་གླང་པོ་ཆེ་དེ་མྱོས་པ་དང་བྲལ་བར་གྱུར་ནས་ཞག་བདུན་ལོན་པ་དང་དཔྱད་རྗེས་སུ་དྲན་ནས་རང་ཉིད་གནས་སུ་འོངས་ཏེ་འདུག་གོ།
en: “Then, when seven days had passed after the elephant was released from its madness, it did remember what it had been taught and came back to the stable.

source: །དེ་ནས་གླང་པོ་ཆེ་འདུལ་མཁན་གྱིས་རིངས་པ་རིངས་པར་རྒྱལ་པོ་ལ་སྨྲས་པ།
en: The elephant trainer quickly reported this to the king:

source: ལྷ་གླང་པོ་ཆེ་དེ་ནི་མཆིས་ལགས་སོ།
en: ‘Your Majesty, that elephant has come back.’

source: །རྒྱལ་པོས་སྨྲས་པ། ཁྱོད་ཀྱིས་ནི་འདི་མ་ཐུལ་ཏོ།
en: “ ‘You did not tame it,’ accused the king.

source: །ལྷ་ཐུལ་ལགས་སོ། །ཅི་མངོན།
en: “ ‘Yes I did, Your Majesty.’ “ ‘Can you prove that?’

source: ལྷའི་སྤྱན་སྔར་བབ་པར་བགྱིའོ་ཞེས་དེས་ལྕགས་ཀྱི་ཐུ་ལུམ་སོ་མལ་དུ་ཚོས་པར་བསྲེགས་པ་ཞིག་དཔྱད་ཀྱི་སར་ཁྱེར་ཏེ་ལེན་དུ་གཞུག་པར་བརྩམས་སོ།
en: “ ‘Yes, I will show Your Majesty.’ “He brought a mass of heated iron to the training ground and directed the elephant to pick it up.

source: །དེ་ནས་དེས་བག་ཚ་བ་མེད་པས་བླང་བར་བརྩམས་པ་དང་གླང་པོ་འདུལ་མཁན་གྱིས་སྨྲས་པ།
en: It then tried to pick it up without hesitation.

source: ལྷ་ལེན་དུ་ནི་བཏུབ་ན་འོན་ཀྱང་འགུམ་པར་འགྱུར་རོ། །རྒྱལ་པོས་སྨྲས་པ།
en: The elephant trainer said, ‘Your Majesty, the elephant can pick it up, but it will die if it really does so.’ “ ‘O gentle sir,’ replied the king, ‘we were tossed about by this elephant, which had been tamed to such an extent.

source: ཀྱེ་མཁས་པ་དེ་ལྟར་ཤིན་ཏུ་དུལ་བ་འདིས་བདག་ཅག་གཡེངས་པ་འདི་ལ་རྒྱུ་ཅི་ཞིག་ཡོད།
en: What is the reason for this?’

source: ལྷ་བདག་གིས་སྔར་ལུས་ཐུལ་གྱི་སེམས་ནི་མ་ལགས་སོ་ཞེས་མ་གསོལ་ཏམ།
en: “ ‘Your Majesty, did I not say to you before that we tame the body, but not the mind?

source: བདག་ནི་ལུས་འདུལ་བ་ལགས་ཀྱི། སེམས་འདུལ་བ་ནི་མ་ལགས་སོ།
en: I tamed its body, but not its mind.’

source: །རྒྱལ་པོས་སྨྲས་པ། སེམས་འདུལ་བ་འགའ་ཡོད་པར་ཁྱོད་ཀྱིས་མཐོང་ངམ། ཐོས་སམ།
en: “ ‘Have you ever seen or heard of anyone who tames the mind?’ asked the king.

source: དེ་ལྷས་བསྐུལ་ནས་སྨྲས་པ། ལྷ་ལུས་འདུལ་བ་དང་སེམས་འདུལ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཆིས་སོ།
en: “Spurred by a god, the elephant trainer said, ‘Your Majesty, those who tame both body and mind are the buddhas, the blessed ones.

source: །འདོད་པའི་རྒྱུས་བྱུང་ཉེས་གཞོམ་ཕྱིར། །མང་པོ་བརྩོན་པར་བྱེད་མོད་ཀྱི།
en: “ ‘Many people exert themselves to destroy sin, Which is caused by desire.

source: །མི་ནུས་པར་ནི་ཤེས་ནས་ཀྱང་།
en: But, after realizing that it is impossible,

source: །བརྩོན་འགྲུས་ཉམས་ནས་ལྡོག་པར་བྱེད། །དེ་དང་དེར་ནི་དེ་ལྟ་བུའི།
en: They regress, their efforts weakened.

source: །འབད་པ་རྣམ་པ་མང་བྱས་ཀྱང་།
en: “ ‘Although many such efforts are made Here and there,

source: །འདོད་པའི་འདོད་ཆགས་ནགས་ཚལ་གྱི།
en: The forest of attachment to the objects of desire

source: །རྩ་ནས་ཕྱིན་པར་མི་འགྱུར་རོ།
en: Is not entirely destroyed.

source: །འདོད་པ་གཞོམ་པར་འདོད་པ་ནི། །ཁ་ཅིག་ཡུལ་རྣམས་སྤོང་བར་བྱེད།
en: “ ‘Some of those who want to conquer desire Abandon sensory objects.

source: །དེ་གཞོམ་འདོད་པ་གཞན་དག་ནི།
en: Others, wanting to conquer it,

source: །དགའ་བཞིན་དབང་པོ་ཚིམ་པར་བྱེད།
en: Satisfy their senses with pleasure.

source: །ལྷ་དང་ལྷ་མིན་མི་དང་སེང་གེ་སྟག་དང་སྦྲུལ་དག་དང་། །སྲིན་བུ་བྱེ་བ་ཕྱེ་མ་ལེབ་དང་འཇིག་རྟེན་འདི་དག་ཀུན།
en: “ ‘Gods, asuras, humans, lions, tigers, snakes, Ten million insects, butterflies, and all beings in the world Are turning just like a wheel in this darkness of existence,

source: །འདོད་པའི་ཞགས་པ་ཤིན་ཏུ་ཕྲ་མོ་རྣམས་ཀྱིས་ཡིད་བཅིངས་ནས། །སྲིད་འགྲོ་ཐིབས་པོ་འདིར་ནི་འཁོར་ལོ་བཞིན་དུ་ཤིན་ཏུ་འཁོར།
en: Their minds caught by subtle nooses, which are desires.

source: །བདག་ནི་སྣ་ཚོགས་ཐབས་ཀྱིས་འདི་ལྟ་བུ། །གཟུགས་བཟང་ཕུན་སུམ་ཚོགས་པའི་གླང་པོ་འདུལ།
en: “ ‘I tamed this beautiful-looking elephant By various means.

source: །རྒྱལ་པོ་གཟུགས་ཅན་མ་ལགས་ཕྲ་སེམས་ནི།
en: O King, the mind, which has no form and is subtle,

source: །དྲང་སྲོང་ཆབ་ཀླུང་འཚལ་བས་མ་ཐུལ་ཏོ།
en: Is not tamed even by a ṛṣi who only drinks water and eats wind.’ “The king asked:

source: །གླང་ཆེན་འདུལ་བ་གཟུགས་མེད་ཕྲ་བའི་སེམས།
en: “ ‘O elephant trainer, while the mind, which has no form and is subtle,

source: །དྲང་སྲོང་ཆུ་ཀླུང་ཟ་བས་མ་ཐུལ་ན།
en: Is not tamed even by a ṛṣi who only drinks water and eats wind,

source: །གང་གི་དབང་དུ་གཟུགས་མེད་སེམས་འགྱུར་ཏེ།
en: Is there anyone who rules the mind, which has no form,

source: །མི་ཡི་འཇིག་རྟེན་དག་ན་ཡོད་དམ་ཀྱེ།
en: In the human world?’ “The elephant trainer answered:

source: །ལྷན་གཅིག་མི་ཡི་འཇིག་རྟེན་ན་མཆིས་ཏེ།
en: In the human world.

source: །རྒྱལ་པོ་ཆེན་པོ་སངས་རྒྱས་མཐུ་བོ་ཆེ།
en: O Great King, the Buddha, the one of great power,

source: །ཉོན་མོངས་སྤངས་པ་དཔའ་བོ་སྟོབས་ལྡན་པ།
en: The one who has abandoned defilements, the powerful hero—

source: །དེ་དང་གང་དག་དེ་འདྲར་རྗེས་འབྲང་བ།
en: He and those who follow him

source: །དེའི་དབང་འདིར་ནི་གཟུགས་མེད་སེམས་འགྱུར་རོ།
en: Rule the mind, which has no form.’

source: །དེ་ནས་རྒྱལ་པོ་འོད་ལྡན་གྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བརྩོན་འགྲུས་དང་སྟོབས་ཐོས་ནས་སྦྱིན་པ་དག་བྱིན། བསོད་ནམས་དག་བྱས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་པ།
en: “Then, having heard of the effort and power of the buddhas, the blessed ones, King Prabhāsa gave donations and made merit, and he made an aspiration for supreme and complete awakening:

source: སྦྱིན་པ་རྒྱ་ཆེན་གྱུར་པ་འདི་ཡིས་སུ།
en: “ ‘By this great gift, may I become

source: །འགྲོ་བར་རང་བྱུང་སངས་རྒྱས་གྱུར་ནས་ནི།
en: A buddha who, by himself, is born among beings. I will liberate those who have not been liberated

source: །སྔོན་གྱི་རྒྱལ་དབང་རྣམས་ཀྱིས་མ་བསྒྲལ་བ།
en: By the lords of victors in the past.

source: །སྐྱེ་བོའི་ཚོགས་དག་བདག་གིས་བསྒྲལ་བར་བྱ།
en: “ ‘By the merit produced by

source: །བདག་གིས་སྐྱེ་དགུ་ལེགས་བསྐྱངས་ལས་བྱུང་བའམ། །བཏང་བ་ལས་བྱུང་བསོད་ནམས་ཡོད་པ་གང་།
en: Well protecting beings and by giving,

source: །དེས་ནི་སངས་རྒྱས་ཉིད་ཐོབ་འཇིག་རྟེན་དག །འདོད་པའི་རིམས་ནད་ལས་རབ་ཐར་བར་བྱ།
en: May I attain the state of a buddha And free worldly beings from the plague that is desire.’

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་རྒྱལ་པོ་འོད་ལྡན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དེའི་ཚེ་དེའི་དུས་ན་ང་ཉིད་དེ་ཡིན་ཏེ།
en: It was me who was King Prabhāsa at that time, on that occasion.

source: ངས་དེར་ཐོག་མར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: There I formed the resolution for supreme and complete awakening for the first time.” 6.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ལ་ཐོག་མར་བསོད་སྙོམས་ཕུལ་ལགས།
en: The Story of the Potter Bṛhaddyuti “O Honored One, to which completely awakened one did the Blessed One, seeking supreme and complete awakening himself, offer almsfood for the first time?”

source: རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་ཡངས་པ་ཞེས་བྱ་བའི་གྲོང་ཁྱེར་ཡོད་དེ། ཡངས་པའི་གྲོང་ཁྱེར་དུ་རྫ་མཁན་ཡངས་པའི་འོད་ཅེས་བྱ་བ་ཞིག་བྱུང་ངོ་།
en: “Great King, once there was a city called Bṛhāvatī, in which there was a potter named Bṛhaddyuti.

source: །དེའི་ཚེ་སྟོན་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་ཞེས་བྱ་བ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ།
en: “At that time, there appeared in the world a teacher named Śākyamuni, who was . . . a buddha, a blessed one.

source: །དེའི་མཆོག་ཟུང་དང་བཟང་པོ་ཟུང་ནི་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་ཞེས་བྱའོ། །རིམ་གྲོ་བྱེད་པ་ནི་དགེ་སློང་ཀུན་དགའ་བོ་ཞེས་བྱའོ།
en: His two best and wisest disciples were called Śāriputra and Maudgalyāyana, and his attendant monk was called Ānanda.

source: །དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དགེ་སློང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་ཡངས་པའི་གྲོང་ཁྱེར་དུ་བྱོན་པ་དང་། དེ་རླུང་ཤས་ཆེ་བའི་སྙུན་གྱིས་ཐེབས་ནས་དེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: Once, when the completely awakened one Śākyamuni was traveling, surrounded by a group of monks, he arrived at the city of Bṛhāvatī. He caught a serious wind illness there and said to the venerable Ānanda, ‘Ānanda, go and bring ghee, oil, and sugar water from the potter Bṛhaddyuti’s place.’

source: ཀུན་དགའ་བོ་སོང་ལ་རྫ་མཁན་ཡངས་པའི་འོད་ལས་མར་དང་། ཏིལ་མར་དང་། བུ་རམ་ཆུ་ཁྱེར་ཏེ་ཤོག་ཤིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལས་མཉན་ནས་རྫ་མཁན་ཡངས་པའི་འོད་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། རྫ་མཁན་ཡངས་པའི་འོད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “ ‘Certainly, O Honored One,’ replied the venerable Ānanda to the Blessed One, and he went to the potter Bṛhaddyuti.

source: །ཡངས་པའི་འོད་ཤེས་པར་གྱིས་ཤིག་བཅོམ་ལྡན་འདས་རླུང་ཤས་ཆེ་བའི་སྙུན་གྱིས་ཐེབས་ཏེ། དེ་ལ་མར་དང་། ཏིལ་མར་དང་བུ་རམ་ཆུ་དགོས་སོ།
en: When he arrived, he said to the potter Bṛhaddyuti, ‘Bṛhaddyuti, please understand that the Blessed One has caught a serious wind illness and needs ghee, oil, and sugar water.’

source: །དེ་ནས་རྫ་མཁན་ཡངས་པའི་འོད་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལས་མཉན་ནས་མར་དང་། ཏིལ་མར་དང་། བུ་རམ་ཆུ་ཁྱེར་ཏེ་བུ་དང་ལྷན་ཅིག་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། མར་དང་། ཏིལ་མར་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་བྱུགས་ནས་ཆུ་འཇམ་པོས་སྐུ་ཁྲུས་བྱས་ཏེ། བུ་རམ་ཆུའི་བཏུང་བ་གསོལ་ཏོ།
en: “The potter Bṛhaddyuti accepted the venerable Ānanda’s request, and went to the completely awakened one Śākyamuni with his son, bringing the ghee, oil, and sugar water. When he arrived, he anointed the Blessed One’s body with the ghee and oil, washed his body with mild water, and offered him a drink of sugar water.

source: །དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་བཟོད་ཅིང་འཚོ་བར་གྱུར་ཏོ།
en: By these things, the completely awakened one Śākyamuni endured the illness, and his health returned.

source: །དེ་ནས་རྫ་མཁན་ཡངས་པའི་འོད་ཀྱིས་དེའི་ཞབས་གཉིས་ལ་གཏུགས་ནས་སྨོན་ལམ་གདབ་པར་བརྩམས་པ།
en: “Thereupon the potter Bṛhaddyuti threw himself at the Blessed One’s feet and expressed this aspiration:

source: བདག་ཀྱང་རབ་ཏུ་སྦྱིན་པ་འདི་ཡིས་ཤཱཀྱའི་རིགས་སྐྱེས་པ།
en: “ ‘By this donation, may I too be born in the family of the Śākyans,

source: །ཡོན་ཏན་རིགས་དང་རུས་དག་མཉམ་པའི་སངས་རྒྱས་ཉིད་གྱུར་ཅིང་།
en: And become a buddha whose good qualities, family, and race are the same as yours.

source: །བདག་གིས་ཚངས་པའི་འཇིག་རྟེན་བར་གྱི་ཉམ་ཐག་འཆི་བ་ཡི། །ཕ་རོལ་ཞི་བ་རྒྱ་ཆེན་འཇིགས་པ་མེད་པ་སྒྲོལ་བར་ཤོག །དེའི་བུས་ཀྱང་སྨོན་ལམ་བཏབ་པ།
en: May I take miserable beings, including those in the world of Brahmā, To the quiet, vast farther shore beyond death, which is free from fear.’ “His son made an aspiration, too:

source: བདག་ཀྱང་ལས་འདིས་ན་གཟུགས་མེད་པའི་ཆོས་རྣམས་རྟོགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་རིམ་གྲོ་བྱེད་པར་གྱུར་ཅིག །ཅེས་བྱས་སོ།
en: ‘May I too, by this act, understand the formless dharmas and become the attendant of the Blessed One.’

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་རྫ་མཁན་ཡངས་པའི་འོད་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ཏེ།
en: It was me who was the potter Bṛhaddyuti at that time, on that occasion.

source: དེར་ངས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ལ་ཐོག་མར་བསོད་སྙོམས་ཕུལ་ལོ།
en: There I offered almsfood for the first time to the completely awakened one Śākyamuni.

source: །དེའི་ཚེ་དེའི་དུས་ཀྱི་བུ་གང་ཡིན་པ་དེ་ནི་ཀུན་དགའ་བོ་ཡིན་ནོ།། །།འདུལ་བ་གཞི།
en: It was Ānanda who was his son at that time, on that occasion.” K.

source: བམ་པོ་ལྔ་བཅུ་རྩ་གཅིག་པ།
en: The Question of King Prasenajit:

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་སླད་དུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་ལ་བསྙེན་བཀུར་བགྱིས་ལགས།
en: The Veneration of Past Buddhas “O Honored One, how many completely awakened ones did the Blessed One serve, seeking supreme and complete awakening himself?”

source: རྒྱལ་པོ་ཆེན་པོ་རེ་ཞིག་གྲངས་མེད་པ་དང་པོ་ལ།
en: “Great King, in the first incalculably long eon,

source: སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ནས།
en: “From the Buddha Śākyamuni

source: འདྲེན་པ་ཡུལ་འཁོར་སྐྱོང་གི་བར།
en: To the Leader Dhṛtarāṣṭra,

source: །དེའི་བར་བདུན་ཁྲི་ལྔ་སྟོང་གི། །སངས་རྒྱས་རྣམས་ནི་ངས་མཆོད་དོ།
en: I venerated Seventy-five thousand buddhas.

source: །གྲངས་མེད་གཅིག་ནི་འདས་པ་ཡི།
en: “Throughout the first incalculably long eon,

source: །རྒྱལ་བ་ངས་ནི་མཆོད་བྱས་ཏེ།
en: I venerated victors in the past.

source: །སངས་རྒྱས་ཉིད་ནི་འདོད་པའི་ཕྱིར།
en: Desiring buddhahood,

source: །ང་ལ་སྐྱོ་བའི་སེམས་མེད་དོ།
en: My heart was never discouraged.

source: །རྒྱལ་པོ་ཆེན་པོ་གྲངས་མེད་པ་གཉིས་པ་ལ་ནི།
en: “Great King, in the second incalculably long eon,

source: སངས་རྒྱས་མར་མེ་མཛད་ནས་ནི།
en: “From the Buddha Dīpaṃkara

source: །དབང་པོའི་རྒྱལ་མཚན་ཐུབ་པའི་བར།
en: To the Muni Indradhvaja,

source: །བདུན་ཁྲི་དྲུག་སྟོང་དག་གི་ནི། །སངས་རྒྱས་རྣམས་ནི་ང་ཡིས་མཆོད།
en: I venerated Seventy-six thousand buddhas.

source: །གྲངས་མེད་གཉིས་པོ་ཚང་བར་ནི།
en: “Throughout the second incalculably long eon,

source: །རྒྱལ་བ་ང་ཡིས་མཆོད་བྱས་ཏེ།
en: I venerated victors.

source: །སྐྱེ་བ་དེ་དང་དེ་དག་ཏུ།
en: In each life,

source: །གྲངས་མེད་པ་གསུམ་པ་ལ་ཡང་།
en: “In the third incalculably long eon, too,

source: །སངས་རྒྱས་ལེགས་མཛད་ནས་བཟུང་སྟེ།
en: From the Buddha Kṣemaṃkara

source: །སངས་རྒྱས་འོད་སྲུང་བར་དག་ཏུ།
en: To the Buddha Kāśyapa,

source: །བདུན་ཁྲི་བདུན་སྟོང་ང་ཡིས་མཆོད།
en: I venerated seventy-seven thousand buddhas.

source: །གྲངས་མེད་གསུམ་པོ་དེ་ལ་ནི།
en: “In the third incalculably long eon,

source: །བྱང་ཆུབ་ཕྱིར་ནི་སྤྱོད་པ་ན།
en: And practiced for awakening,

source: །དེ་ཚེ་ང་ལ་སྐྱོ་སེམས་མེད།
en: My heart was never discouraged.

source: །ང་ནི་བྱང་ཆུབ་སེམས་དཔའ་ན།
en: “When I was a bodhisattva,

source: །སངས་རྒྱས་མཆོག་ནི་དེ་དག་མཆོད།
en: I venerated these most excellent buddhas.

source: །འཇིག་རྟེན་འདྲེན་པ་དེ་ཀུན་གྱིས།
en: All these leaders of the world

source: །ང་ནི་སངས་རྒྱས་ཉིད་དུ་བསྟན།
en: Predicted my buddhahood.

source: །ངས་ནི་སྔོན་བསམས་གང་ཡིན་པ།
en: “The wishes I once made

source: །ང་ནི་སྨོན་ལམ་ཐམས་ཅད་རྫོགས།
en: Are all now accomplished.

source: །ངས་ནི་སངས་རྒྱས་ཁུར་བོར་ཏེ།
en: As the Buddha, I relieve burdens

source: །སེམས་ཅན་རྣམས་ནི་རྗེས་སུ་བཟུང་།
en: And help beings.”

source: །དེ་ནས་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའ་སྟེ་རྗེས་སུ་ཡི་རངས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་སོང་ངོ་།
en: Thereupon King Prasenajit of Kosala rejoiced in and praised the words of the Blessed One. He bowed low until his forehead touched the feet of the Blessed One, and then he departed from the Blessed One’s presence. L.

source: །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ཞུས་པ།
en: The Question of Ānanda or Section of Many Buddhas Thereupon the venerable Ānanda asked the Buddha, the Blessed One:

source: འཇིག་རྟེན་གཙོ་བོ་རྣམ་འདྲེན་པ།
en: “O best of the world, leader,

source: །ཐུབ་པ་ཁྱོད་ཀྱི་བྱང་ཆུབ་ཐུགས།
en: Muni, may the one of great fortune tell me Where your resolution for awakening

source: །ཐོག་མར་གང་དུ་བསྐྱེད་པ་དག །སྐལ་ལྡན་ཆེན་པོ་བདག་ལ་གསུངས།
en: Was formed for the first time! “How many buddhas did you once serve

source: །ཁྱོད་སྔོན་བྱང་ཆུབ་སྤྱོད་པ་ན།
en: While you were practicing for awakening?

source: །སངས་རྒྱས་ཇི་སྙེད་དུས་གང་དུ།
en: At what time?

source: །ཇི་ལྟ་བུར་ནི་བསྙེན་བཀུར་མཛད།
en: In which way?

source: །མི་མཆོག་དེ་ནི་བདག་ལ་གསུངས།
en: May the best of humans tell me.”

source: །ཀུན་དགའ་བོ་ཡི་ཚིག་གསན་ནས།
en: Upon hearing Ānanda’s words,

source: །རྐང་གཉིས་དམ་པ་རྫོགས་སངས་རྒྱས།
en: The excellent human, the Buddha,

source: །འགྲོ་ལ་ཐུགས་རྗེ་མཛད་ནས་སུ། །ཐུབ་པས་བྱང་ཆུབ་སྤྱོད་པ་གསུངས།
en: The Muni, spoke about his practice for awakening, Out of mercy for beings.

source: །སངས་རྒྱས་འདོད་ཆགས་བྲལ་ཐོས་ཤིང་།
en: “Having heard of buddhas who were free from desire

source: །གླང་པོ་དྲེགས་པའི་ཤས་ཆེན་དང་། །འཇིག་རྟེན་སྡུག་བསྔལ་གྱུར་མཐོང་ནས།
en: And having seen the dreadful force of the mad elephant That is the suffering world,

source: །ངས་ནི་བྱང་ཆུབ་སེམས་བསྐྱེད་དོ།
en: I formed the resolution for awakening.

source: །མི་དབང་འོད་ལྡན་གྱུར་པ་ན།
en: “When I was a human king, Prabhāsa,

source: །ངས་ནི་བྱང་ཆུབ་འདོད་པའི་ཕྱིར།
en: I wished for awakening,

source: །ངས་ནི་བརྟན་པོར་དམ་བཅས་ཏེ།
en: Made a firm vow,

source: །སྐྱོན་མེད་པ་ཡི་སྦྱིན་པ་བཏང་།
en: And gave untainted donations.

source: །ང་ནི་རྫ་མཁན་གྱུར་པ་ན།
en: “When I was a potter,

source: །སངས་རྒྱས་ཤཱཀྱ་ཐུབ་མཐོང་ནས།
en: Having seen the Buddha Śākyamuni, I venerated him with ghee and oil,

source: །བྱང་ཆུབ་ཕྱིར་ནི་ཐོག་མར་ངས། །མར་དང་ཏིལ་མར་གྱིས་མཆོད་དོ།
en: My first offering directed toward awakening.

source: །སྔོན་གྱི་སྐྱེ་བ་གཞན་དག་ཏུ།
en: “In another past life,

source: །ཚོང་དཔོན་བུ་མོར་གྱུར་པ་ན།
en: When I was a daughter of the head of a guild,

source: །སངས་རྒྱས་ཀཽཎྜི་ནྱ་མཐོང་ནས།
en: I saw the Buddha Kauṇḍinya

source: །ངས་ནི་མར་མེའི་སྦྱིན་པ་བྱས།
en: And made a donation of a lamp. “I once mastered the Tripiṭaka

source: །སངས་རྒྱས་གཞན་གྱིས་མི་ཐུལ་བའི། །ང་སྔོན་སྡེ་སྣོད་གསུམ་པ་ལས།
en: Of the Buddha Aparājita.

source: །དགེ་སློང་དགེ་འདུན་རྩོད་པ་ལ།
en: But, quarreling with the community of monks,

source: །དགེ་འདུན་ལ་ནི་བུད་མེད་སྨྲས།
en: I insulted the community by calling the monks ‘women.’

source: །ཚིག་གི་ཉེས་བྱས་བྱུང་བས་ན།
en: “After I committed that verbal sin,

source: །མོད་ལ་བུད་མེད་ཉིད་དུ་གྱུར།
en: I immediately became a woman.

source: །སླར་ཡང་སེམས་དད་བྱས་པས་ནི།
en: My mind was filled with faith again,

source: །སྐྱེས་པ་ཉིད་ནི་ཐོབ་པར་གྱུར།
en: And so I attained manhood.

source: །ང་ནི་རྒྱལ་པོའི་སྲས་གྱུར་ཚེ།
en: When I was a son of a king,

source: །གཅེན་པོ་རིན་ཆེན་གཙུག་ཏོར་ལ།
en: I venerated my brother, Ratnaśikhin,

source: །མར་མེའི་སྦྱིན་པས་མཆོད་བྱས་ཤིང་།
en: With a donation of lamps. “I was the servant of Kṣemaṃkara

source: །ངས་ནི་ཟླ་གསུམ་དྲུག་བཅུ་རུ། །བདེ་མཛད་ཀྱི་ནི་ཞབས་འབྲིང་བྱས།
en: For the three months of summer sixty times.

source: །ངས་ནི་མྱ་ངན་འདས་པ་དེའི།
en: After his nirvāṇa, I offered

source: །མཆོད་རྟེན་ལ་ནི་ནོར་ཀུན་ཕུལ།
en: All my treasure to his stūpa.

source: །ང་ནི་ཚོང་དཔོན་གྱུར་པ་ན།
en: “When I was the head of a guild,

source: །སྒྲ་སྙན་དབྱངས་ལ་ཟླ་གསུམ་མཆོད།
en: I venerated Praṇāda for three months

source: །དེ་ཡི་མཆོད་རྟེན་མཐོན་པོ་ནི།
en: And built him a stūpa,

source: །དགུ་བཅུ་རྩ་གཅིག་རྩིག་ཏུ་བཅུག །ང་ནི་བྲམ་ཟེར་གྱུར་པ་ན།
en: Which was ninety-one hasta in height. “When I was a brahmin,

source: །སངས་རྒྱས་དཔལ་འབྱུང་མཐོང་ནས་དགའ།
en: I was pleased to see the Buddha Śrīsaṃbhava.

source: །ལེགས་པར་ཐལ་སྦྱར་དེ་ནས་ཡང་།
en: I respectfully made the gesture of supplication

source: །མི་མཆོག་ལ་ནི་མཆོད་པ་བྱས།
en: And venerated that most excellent of humans.

source: །ང་སྔོན་བྲམ་ཟེར་གྱུར་པ་ན།
en: “Once when I was a brahmin

source: །བསྟན་བཅོས་དུ་མ་འཇིགས་མེད་ཚེ།
en: Who was well versed in many scriptures,

source: །སངས་རྒྱས་ཕན་པར་བཞེད་མཛད་པ།
en: I invited the Buddha Hiteṣin

source: །ང་ཡི་སྟན་ལ་སྤྱན་དྲངས་སོ།
en: To my seat.

source: །སྔོན་ནི་དཀའ་ཐུབ་ལྡན་པ་ཡི།
en: “Once when I was an ascetic ṛṣi

source: །དྲང་སྲོང་ཆོས་ལ་གནས་གྱུར་ཚེ།
en: Who was practicing the Dharma,

source: །ངས་ནི་རི་བོའི་ཁ་ནས་མཆོངས།
en: And threw myself from the top of a mountain.

source: །དྲང་སྲོང་གྱུར་ནའང་ཡིད་དགའ་བས།
en: “When I was another ṛṣi

source: །སངས་རྒྱས་བལྟ་ན་སྡུག་མཐོང་ནས།
en: I saw the Buddha Sudarśana. This pleased my mind And I invited him to my hermitage

source: །རྩ་བ་དང་ནི་འབྲས་བུའི་ཕྱིར། །བསྟི་གནས་བཞུགས་པ་ངས་སྤྱན་དྲངས།
en: For roots and fruits.

source: །འཇིག་རྟེན་འདྲེན་པ་སྤྱན་མཛེས་ལ། །དྲང་སྲོང་གྱུར་ཚེ་བཀུར་སྟི་བྱས། །ཤིང་ཤུན་ཡིད་དུ་འོང་བ་ཡིས།
en: “I honored Sunetra, the leader of the world, When I was a ṛṣi.

source: །ངས་ནི་མི་ཡི་མཆོག་བཀབ་བོ།
en: I dressed that most excellent of humans With comfortable bark.

source: །ང་ནི་རྒྱལ་པོར་གྱུར་པ་ན།
en: “When I was a king,

source: །ཡན་ལག་བཞི་པའི་དཔུང་སྤངས་ནས།
en: I abandoned my army consisting of four divisions.

source: །བྱང་ཆུབ་འདོད་པའི་ཆེད་དུ་ངས།
en: Seeking awakening,

source: །ཡུལ་འཁོར་སྐྱོང་གི་ཞབས་འབྲིང་བྱས།
en: I attended Dhṛtarāṣṭra.

source: །སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ནས།
en: “From the Buddha Śākyamuni

source: །འདྲེན་པ་ཡུལ་འཁོར་སྐྱོང་གི་བར།
en: To the Leader Dhṛtarāṣṭra,

source: །བདུན་ཁྲི་དང་ནི་ལྔ་སྟོང་གི། །སངས་རྒྱས་རྣམས་ལ་ང་ཡིས་མཆོད།
en: I venerated Seventy-five thousand buddhas.

source: །གྲངས་མེད་གཅིག་ནི་འོངས་པ་ཡི།
en: “Throughout the first incalculably long eon,

source: །གྲངས་མེད་པ་དང་པོའོ།
en: “This encompasses the first incalculably long eon.

source: །བྲམ་ཟེ་ཁྱེའུ་གྱུར་དེ་ཡི་ཚེ།
en: “When I was a young brahmin, I saw the Buddha Dīpaṃkara,

source: །འོད་དང་གྲགས་པར་ལྡན་པ་ཡི། །སངས་རྒྱས་མར་མེ་མཛད་མཐོང་ནས།
en: Who was famed for his radiance,

source: །ཨུཏྤལ་སྔོན་པོ་བདུན་གྱིས་མཆོད།
en: And venerated him with seven blue utpalas.

source: །ང་ནི་རྒྱལ་པོར་གྱུར་པ་ན། །དཀའ་ཐུབ་སྤྱོད་ཅེས་བྱ་བ་ཡི།
en: “When I was a king,

source: །སངས་རྒྱས་མཚན་མངའ་མཐོང་ནས་ནི།
en: I saw a buddha with the marks Who was named Ascetic Practitioner,

source: །མི་མཆོག་ལ་ནི་བླ་རེས་མཆོད།
en: And venerated that most excellent of humans with an upper garment.

source: །རྒྱལ་པོར་གྱུར་ཚེ་མུན་འཇོམས་པའི།
en: “When I was a king,

source: །སྐལ་ཆེན་ལ་ནི་རིན་པོ་ཆེ།
en: I offered veneration

source: །སྣ་ཚོགས་བཀྲ་བའི་རོལ་མོ་ཡི།
en: In the form of various treasures and excellent music

source: །མཆོད་པ་དག་གིས་བཞེངས་གསོལ་ཏོ།
en: To the fortunate one Tamonuda.

source: །ཀུན་དགའ་མི་དབང་ང་གྱུར་པས།
en: “Ānanda, as the master of the people

source: །སེང་གེ་སེང་གེའི་རྩལ་མངའ་ལ།
en: I venerated Siṃha, who had a lion’ s power, That most excellent of humans,

source: །རིན་ཆེན་ཡུ་བ་ཅན་གདུགས་ཀྱིས། །མི་མཆོག་ལ་ནི་མཆོད་པ་བྱས།
en: With an umbrella with a jeweled shaft.

source: །རྒྱལ་པོར་གྱུར་ཚེ་གྲོང་ཁྱེར་ནི།
en: “When I was a king,

source: །སྟོང་ཕྲག་དྲུག་བཅུ་རྣམས་སུ་ཡང་།
en: In sixty thousand cities I invited and venerated

source: །མི་ཡི་ཉི་མ་བདེ་མཛད་ནི། །སྤྱན་དྲངས་ནས་ནི་མཆོད་པ་བྱས།
en: The sun among humans, Kṣemaṃkara.

source: །འཇིག་རྟེན་འདྲེན་པ་མི་དབང་ལ།
en: “I served the leader of the world, Narendra,

source: །བསྲོ་གང་ལས་དང་དེ་བཞིན་དུ།
en: By building a steam bath,

source: །ཨ་གར་ནག་པོའི་དྲི་དག་གིས།
en: And with the perfume of black agaru,

source: །བྲམ་ཟེར་གྱུར་ཚེ་ཞབས་འབྲིང་བྱས།
en: When I was a brahmin.

source: །གྲོང་ཁྱེར་རྒྱལ་སྲིད་འཕེལ་བར་ནི།
en: “In the city of Rājyavardhana,

source: །བྲམ་ཟེའི་སངས་རྒྱས་སུམ་བཅུ་པོ།
en: I served thirty brahmin buddhas renowned in the world,

source: །གཙུག་ཏོར་ཅན་ཞེས་འཇིག་རྟེན་གྲགས།
en: All of whom were named Śikhin,

source: །རྒྱལ་པོར་གྱུར་ཚེ་མཆོད་པ་བྱས།
en: When I was a king.

source: །གྲོང་ཁྱེར་འབྲས་འཕེལ་དག་ཏུ་ནི།
en: “In the city of Grown Rice, When I was the head of a guild, I led the pure life

source: །སངས་རྒྱས་ཉི་ཤུ་རྩ་ལྔ་ལ། །ང་ནི་ཚོང་དཔོན་གྱུར་པ་ན། །ཚངས་པར་སྤྱད་པས་མཆོད་པ་བྱས།
en: And venerated twenty-five buddhas.

source: །གྲོང་ཁྱེར་དགའ་བ་དེ་ཉིད་དུ།
en: “In the very city Delight,

source: །ང་ནི་ཚོང་དཔོན་གྱུར་པའི་ཚེ།
en: When I was the head of a guild,

source: །སངས་རྒྱས་གཙུག་ཏོར་འཇིག་རྟེན་གྲགས། །གཙུག་ལག་ཁང་གིས་མཆོད་པ་བྱས།
en: I venerated by building a monastery The Buddha Śikhin, who was renowned in the world.

source: །ཚོང་དཔོན་གྱུར་ཚེ་རྒྱལ་བ་དྲུག །མཆོད་ཕྱིར་གླང་ཆེན་རྟ་གསེར་དང་། །བུད་མེད་རྣམས་དང་ནོར་བུ་ཡི། །རྒྱན་གྱིས་སྐྱེད་མོས་ཚལ་བྱས་སོ།
en: “When I was the head of a guild, I built a park adorned with elephants, horses, gold, Women, and jewels To venerate six victors.

source: །རྒྱལ་པོར་གྱུར་ཚེ་དད་པ་ཡིས། །གྲོང་ཁྱེར་ཡིད་འོང་དེ་ཉིད་དུ། །བྱང་ཆུབ་དོན་དུ་གཉེར་བ་ངས།
en: “When I was a king, In a comfortable city, out of faith

source: །གཙུག་ཏོར་ཅན་ལ་སྐྲ་བྲེགས་སོ།
en: I shaved off my hair in front of Śikhin, Seeking awakening.

source: །ཀུན་དགའ་བྲམ་ཟེར་གྱུར་པ་ན།
en: “Ānanda, when I was a brahmin,

source: །ཐུབ་ཆེན་མ་འགགས་དེ་ལ་ནི། །བྱང་ཆུབ་དོན་དུ་གཉེར་བ་ངས།
en: I venerated that great Muni, Aniruddha,

source: །འབྲས་བུ་མཆོག་གིས་མཆོད་པ་བྱས།
en: With the best fruits, Seeking awakening.

source: །ཚོང་དཔོན་དུ་ནི་གྱུར་པ་ན།
en: “When I was the head of a guild,

source: །འཇིག་རྟེན་འདྲེན་པ་སྤྱན་མཛེས་ལ།
en: I venerated the leader of the world, Sunetra,

source: །ནོར་བུ་རིན་ཆེན་གྱིས་མཆོད་ཅིང་།
en: With precious jewels

source: །གཙུག་ལག་ཁང་ནི་ཉམས་དགའས་མཆོད།
en: And a pleasant monastery.

source: །དེད་དཔོན་དུ་ནི་གྱུར་པ་ན།
en: “When I was a caravan leader,

source: །བྱང་ཆུབ་ཤིང་གི་དྲུང་ན་ནི།
en: Under the Bodhi tree,

source: །སངས་རྒྱས་ལེགས་འཁྲུངས་བཞུགས་མཐོང་ནས།
en: I saw the Buddha Sujāta

source: །ཐོག་མར་བསོད་སྙོམས་ལ་སྤྱན་དྲངས།
en: And invited him for almsfood for the first time.

source: །ང་ནི་དེད་དཔོན་གྱུར་པ་ན།
en: “When I was a caravan leader,

source: །བྱང་ཆུབ་ཤིང་དྲུང་ཐུབ་པ་ནི།
en: Under the Bodhi tree I saw
